Repository: austineade/websites
Catalog: adedge.com/adedge.com/modules/autolocale/po/*.po
Languages: fr, he, hu, ja, pt, tr

source: Now you can <a href="@url">import interface translations</a> automatically
fr: Vous pouvez <a href="@url">importer les traductions</a> automatiquement
he: כעת ניתן <a href="@url">לייבא תרגומי ממשק</a> באופן אוטומטי
hu: Most már <a href="@url">automatikusan importálhatóak</a> a fordítások
ja: 今、あなたは自動的に<a href="@url">インターフェース翻訳のインポート</a>を行えます
pt: Agora pode <a href="@url">importar traduções</a> automaticamente
tr: Şimdi arayüz çevirilerini otomatik olarak <a href="@url">yükleyebilirsiniz</a>.

source: Automatically imports interface translations.
fr: Importe automatiquement les traductions d'interface
he: מייבא תרגומי ממשק באופן אוטומטי.
hu: Automatikusan importálja a felület fordításokat.
ja: インターフェースの翻訳文字列を自動的にインポートします。
pt: Importa traduções automaticamente.
tr: Arayüz çevirilerini otomatik olarak yükler.

source: Body
fr: Corps
he: תוכן
hu: Törzs
pt: Corpo
tr: Gövde

source: Title
fr: Titre
he: כותרת
hu: Cím
pt: Título
tr: Başlık

source: Page
he: עמוד
hu: Oldal
pt: Página
tr: Sayfa

source: If you want to add a static page, like a contact page or an about page, use a page.
fr: Si vous voulez ajouter une page statique, comme une page de contact ou une page "à propos", utilisez une page
he: להוספת עמוד סטטי, כמו עמוד יצירת קשר או אודות, ניתן להשתמש ב"עמוד".
hu: Statikus oldal, például kapcsolat vagy impresszum oldal hozzáadásához érdemes az oldal típust használni.
pt: Se quiser adicionar uma página estática, como por exemplo uma página de contactos ou uma página sobre os autores do site, utilize o tipo de conteúdo página.
tr: Eğer durağan bir sayfa eklemek istiyorsanız, bir iletişim sayfası veya hakkında sayfası gibi, bir sayfa kullanın.

source: Story
fr: Histoire
he: כתבה
hu: Írás
pt: Artigo
tr: Hikaye

source: Stories are articles in their simplest form: they have a title, a teaser and a body, but can be extended by other modules. The teaser is part of the body too. Stories may be used as a personal blog or for news articles.
fr: Les histoires sont des articles dans leur forme la plus simple: ils ont un titre, une accroche et un corps de texte, mais ils peuvent être étendus par d'autres modules. L'accroche fait partie du corps également. Les histoires peuvent être utilisées pour des blogs ou des articles d'actualité.
he: כתבות הן מאמרים בצורה הפשוטה ביותר: יש להם כותרת, תקציר ותוכן. ניתן להרחיב אותם בעזרת רכיבים נוספים. התקציר גם הוא חלק מהתוכן. כתבות משמשות לבלוג אישי, או לכתיבת חדשות.
hu: Az írás a legegyszerűbb tartalom típus: rendelkezik címmel, bevezetővel és hosszabb tartalommal, de különböző modulok kiterjeszthetik a képességeit. A bevezető a hosszabb tartalom első része. Az írások felhasználhatóak személyes blog szerkesztésére, hírekként, cikkekként egyaránt.
pt: Os artigos são o tipo de conteúdo mais simples: têm um título, um resumo e um corpo, mas pode ser extendidos por outros módulos. O resumo constitui também uma parte do corpo. Os artigos podem ser usados como um blogue pessoal para para notícias.
tr: Hikayeler en basit anlamda birer makaledirler: başlıkları, kırpılmış biçimi ve bir gövdeleri vardır; diğer eklentiler tarafından geliştirilebilirler. Kırpılmış kısım da gövdenin bir parçasıdır. Hikayeler kişisel ağ günlüğü veya haber yazısı gibi kullanılabilir.

source: Automatic import scans all enabled modules and themes for interface translation files under their directories and imports all files found for the selected language. This operation could be resource intensive, and is irreversible.
fr: L'import automatique balaye tous les modules activés et les thèmes pour récupérer les fichiers de traduction dans leurs répertoires et les importer dans le langage sélectionné. Cette opération peut demander beaucoup de ressources, et est irréversible.
he: ייבוא אוטומטי סורק את כל הרכיבים והעיצובים הקיימים עבור קבצי תרגום בתיקיות המתאימות, ומייבא את כל התרגומים שנמצאו לשפה הנבחרת. הפעולה יכולה לקחת משאבי מערכת רבים, ואינה הפיכה.
hu: Az automatikus importálás minden bekapcsolt modult és smink könyvtárában fordítási fájlokat keres, majd minden a kiválasztott nyelvhez megtalált fájlt importál. Ez a művelet sok memóriát és időt vehet igénybe, és ráadásul visszafordíthatatlan folyamat.
ja: 自動インポートは、すべての有効化されたモジュールとテーマのディレクトリからインターフェースの翻訳ファイルを探し出し、見つかったすべてのファイルを選択された言語にインポートします。 この操作は、大量のメモリを消費することもあり、また、元に戻すことはできません。
pt: A importação automática, procura todos os módulos e temas activos por ficheiros de tradução nos seus directórios e importa todos os ficheiros encontrados para o idioma seleccionado. Esta operação poderá ser intensiva na utilização de recursos sendo irreversível.
tr: Otomatik yükleme tüm etkin eklenti ve temalarınızı çeviri dosyası olup olmadığına bakmak için tarar. Bu kaynak harcayan bir işlemdir ve değiştirilemez.

source: Automatic import
fr: Import automatique
he: ייבוא אוטומטי
hu: Automatikus import
ja: 自動インポート
pt: Importação automática
tr: Otomatik yükleme

source: No foreign language enabled on your site. You need to <a href="@urladd">add</a> and <a href="@urlenable">enable</a> at least one foreign language to import strings for.
fr: Il n'y a pas de langue étrangère sur votre site. Vous aurez besoin d'en <a href="@urladd">ajouter</a> et d'en <a href="@urlenable">activer</a> au moins une pour pouvoir importer les chaînes.
he: אין שפה זרה שמופעלת באתר שלך. עליך <a href="@urladd">להוסיף</a> ו<a href="@urlenable">להפעיל</a> לפחות שפה זרה אחת אליה לייבא מחרוזות.
hu: Nincs bekapcsolt idegen nyelv a webhelyen. <a href="@urladd">Hozzá kell adni</a> és <a href="@urlenable">be kell kapcsolni</a> legalább egy idegen nyelvet, amelybe a fordítások importálhatók lesznek.
ja: サイト上で有効になっている外国語がありません。 少なくとも1つ、文字列をインポートする外国語を<a href="@urladd">追加</a>し、<a href="@urlenable">有効化</a>する必要があります。
pt: Não se encontra nenhum idioma alternativo activo no site. Precisa de <a href="@urladd">adicionar</a> e <a href="@urlenable">activar</a> no mínimo um idioma alternativo para importar expressões traduzidas.
tr: Sitenizde tanımlı yabancı dil yok. Çevirileri yüklemek için en az bir yabancı dil <a href="@urladd">eklemeli</a> ve <a href="@urlenable">etkinleştirmelisiniz</a>.

source: Language
fr: Langue
he: שפה
hu: Nyelv
ja: 言語
pt: Idioma
tr: Dil

source: Select the language to autoimport translation files into.
fr: Sélectionner la langue dans laquelle vous voulez importer les chaînes.
he: בחר את השפה אליה יש לייבא את קבצי התרגום באופן אוטומטי.
hu: Az automatikus importálás célnyelve.
ja: 翻訳ファイルを自動インポートする言語を選択してください。
pt: Seleccione o idioma para o qual serão importados automaticamente os ficheiros de tradução.
tr: Otomatik yüklenecek çeviri dosyalarının hangi dile gideceğini seçin.

source: Remove existing translations first
fr: Supprimer les traductions existantes
he: מחק תרגומים קיימים תחילה
hu: Meglévő fordítások eltávolítása
ja: はじめに既存の翻訳文字列を削除する
pt: Remover as traduções existentes
tr: Önce kurulu çevirileri kaldır.

source: It is advised to remove the existing translations in the given language for performance reasons, if you have no custom strings added, which are not available in the PO files to import. This removes strings left from upgrades or previously tried and removed modules.
fr: Il est conseillé de supprimer les traductions existantes dans un langage donné pour des raisons de performances, si vous n'avez pas de chaînes qui vous sont personnelles, et donc non-disponibles dans les fichiers PO à importer. Cette option supprime les chaînes des mises à jour précédentes ou des précédents imports, ainsi que celles des modules supprimés.
he: מומלץ למחוק תרגומים קיימים לשפה הנתונה, לצרכי ביצועים, אם לא הוספת מחרוזות מותאמות בנוסף על מה שקיים בקבצי התרגום. מחרוזות שנשארו משדרוגים ישנים, או מרכיבים שהופעלו והוסרו, יימחקו גם כן.
hu: Javasolt az adott nyelven korábban importált meglévő fordítások eltávolítása, hiszen ez javítja a rendszer teljesítményét. Figyelni kell azonban, hogy ilyenkor az egyedileg módosított vagy hozzáadott (PO fájlokban nem tárolt) fordítások is elvesznek. Ez a művelet alkalmas egy Drupal frissítés előttről bent maradt vagy kipróbált de nem használt modulokhoz importált fordítások eltávolítására.
ja: インポートの前に、既存の翻訳文字列を削除するかどうかを指定してください。 独自の文字列を追加していない場合は、パフォーマンス上の理由から、所定の言語にある既存の翻訳文字列を削除することをお勧めします。 これは、アップグレードの際に不要になっていたり、すでに使用していないモジュールの翻訳文字列を削除します。
pt: Aconselha-se a remoção das traduções existentes no idioma respectivo por razões de desempenho, caso não tenha adicionado expressões traduzidas personalizadas (que não se encontram disponíveis nos ficheiros PO a importar). Esta opção remove textos deixados por actualizações ou por módulos anteriormente instalados e entretanto removidos.
tr: Eğer PO dosyalarında olmayıp kendi eklediğiniz çeviri yoksa, performans açısından, var olan çevirilerin kaldırılması önerilir. Böylece güncelleştirmelerden veya denenip kaldırılmış eklentilerden kalan çeviriler kaldırılacaktır.

source: Perform automatic import
fr: Effectuer l'import automatique
he: בצע ייבוא אוטומטי
hu: Automatikus import végrehajtása
ja: 自動インポートの実行
pt: Executar a importação automática
tr: Otomatik yüklemeyi yap

source: Invalid language code (@langcode) choosen for automatic import.
fr: Code de langue invalide (@langcode) pour l'import automatique.
he: קוד השפה שנבחר (@langcode) אינו תקף.
hu: @langcode az automatikus importáláshoz nem érvényes nyelv azonosító.
ja: 自動インポートに無効な言語コード（@langcode）が選択されました。
pt: Código de idioma (@langcode) inválido para a importação automática.
tr: Otomatik yükleme için geçersiz dil kodu (@language).

source: Existing translations removed from @language.
fr: Les traductions existantes pour @langage ont été supprimées.
he: תרגומים קיימים נמחקו מ@language.
hu: @language meglévő fordításai eltávolítva.
ja: @language から既存の翻訳文字列が削除されました。
pt: Traduções actuais removidas de @language.
tr: @language dilinde var olan çeviriler kaldırıldı.

source: New @language strings imported.
fr: Nouvelles chaînes pour @language importées.
he: תרגומים חדשים ל@language יובאו.
hu: Új @language nyelvű fordítások importálva.
ja: 新しい @language の文字列がインポートされました。
pt: Novas expressões traduzidas importadas para @language.
tr: @language çevirileri yüklendi.

source: Imported translation file @filename
ja: 翻訳ファイル @filename をインポートしました。

source: Autolocale
ja: オートロケール
